# ExternalDefinitions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitions Class
Members See Also
---
Supports the creation of new shared parameters definitions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ExternalDefinitions : Definitions
```

Visual Basic
---
```text
Public Class ExternalDefinitions _
	Inherits Definitions
```

Visual C++
---
```text
public ref class ExternalDefinitions : public Definitions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Definitions Autodesk.Revit.DB..::..ExternalDefinitions
# See Also
ExternalDefinitions Members
Autodesk.Revit.DB Namespace